000100 identification division.
000200 program-id. hello-world.
000300 author. callum fromant.
000400 procedure division.
000500     display "Hello, World!".
000600     stop run.

