000100 identification division.
000200 program-id. hello-world.
000300 author. callum fromant.
000300 procedure division.
000400     display "Hello, World!".
000500     stop run.
