IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 FIRST_NAME PIC A(10).
01 LAST_NAME PIC A(10).
01 AGE PIC 9(3).

PROCEDURE DIVISION.
  DISPLAY 'what is your first name?: '.
  ACCEPT FIRST_NAME.
  DISPLAY 'What is your last name?: '.
  ACCEPT LAST_NAME.
  DISPLAY 'How old are you?: '.
  ACCEPT AGE.
  DISPLAY 'hello ' FIRST_NAME ' ' LAST_NAME 'you are: ' AGE ' years old!'.
  STOP RUN.